# Pandas 

1. Data representation is better than numpy
2. Can store hettrogenous data

In [1]:
import pandas as pd

In [ ]:
# We have 2 data structures

1. Series --> 1D
2. DataFrame --> 2D

# Series

# Different ways to create a Series

1. list or tuple
2. array
3. dict

In [3]:
lst = ['Ganga' , 'Yamuna' , 'Brahmaputra' , 'Jehlum' , 'Kaveri']

pd.Series(lst)

0          Ganga
1         Yamuna
2    Brahmaputra
3         Jehlum
4         Kaveri
dtype: object

In [4]:
lst = ('Ganga' , 'Yamuna' , 'Brahmaputra' , 'Jehlum' , 'Kaveri')

pd.Series(lst)

0          Ganga
1         Yamuna
2    Brahmaputra
3         Jehlum
4         Kaveri
dtype: object

In [5]:
lst = ['Ganga' , 'Yamuna' , 'Brahmaputra' , 'Jehlum' , 'Kaveri']

pd.Series(lst , index = ['a' , 'b' , 'c' , 'd' , 'e'])

a          Ganga
b         Yamuna
c    Brahmaputra
d         Jehlum
e         Kaveri
dtype: object

In [6]:
lst = ['Ganga' , 'Yamuna' , 'Brahmaputra' , 'Jehlum' , 'Kaveri']

pd.Series(lst , index = ['a' , 'b' , 'c' , 'd' ])

ValueError: Length of values (5) does not match length of index (4)

In [8]:
lst = ['Ganga' , 'Yamuna' , 'Brahmaputra' , 'Jehlum' , 'Kaveri']

pd.Series(lst , index = range(50 , 55))

50          Ganga
51         Yamuna
52    Brahmaputra
53         Jehlum
54         Kaveri
dtype: object

In [9]:
import numpy as np

In [11]:
arr = np.random.rand(5,)

In [13]:
pd.Series(arr)

0    0.791783
1    0.934819
2    0.442132
3    0.992466
4    0.594171
dtype: float64

In [14]:
d = {'name' : 'xyz' , 'age' :34 , 'salary':545454}

In [15]:
pd.Series(d)

name         xyz
age           34
salary    545454
dtype: object

In [16]:
pd.Series(d , index = ['a' , 'age' , 'c'])

a      NaN
age     34
c      NaN
dtype: object

In [17]:
pd.Series(d , index = ['salary' , 'age' , 'location'])

salary      545454
age             34
location       NaN
dtype: object

# Indexing in series

In [18]:
lst = ['Ganga' , 'Yamuna' , 'Brahmaputra' , 'Jehlum' , 'Kaveri']

ser = pd.Series(lst , index = ['a' , 'b' , 'c' , 'd' , 'e'])

In [19]:
ser

a          Ganga
b         Yamuna
c    Brahmaputra
d         Jehlum
e         Kaveri
dtype: object

# Zero indexing
- start = inclusive
- stop = exculsive


# Custom indexing
- start and stop = inclusive

In [20]:
ser[2]

C:\Users\Mohammed Israr\AppData\Local\Temp\ipykernel_16360\3656152456.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[2]

'Brahmaputra'

In [21]:
ser[-3]

C:\Users\Mohammed Israr\AppData\Local\Temp\ipykernel_16360\3055893507.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[-3]

'Brahmaputra'

In [22]:
ser['c']

'Brahmaputra'

In [24]:
ser[1:4]

b         Yamuna
c    Brahmaputra
d         Jehlum
dtype: object

In [26]:
ser['b' : 'e']

b         Yamuna
c    Brahmaputra
d         Jehlum
e         Kaveri
dtype: object

In [27]:
ser

a          Ganga
b         Yamuna
c    Brahmaputra
d         Jehlum
e         Kaveri
dtype: object

In [28]:
lst = ['Ganga' , 'Yamuna' , 'Brahmaputra' , 'Jehlum' , 'Kaveri']

ser = pd.Series(lst )

In [29]:
ser

0          Ganga
1         Yamuna
2    Brahmaputra
3         Jehlum
4         Kaveri
dtype: object

In [30]:
ser[1:4]

1         Yamuna
2    Brahmaputra
3         Jehlum
dtype: object

In [38]:
brics_country = ['Brazil', 'Russia', 'India', 'China', 'South Africa']

brics_currency = ['Real', 'Ruble', 'Rupee', 'Renminbi', 'Rand' ]

In [39]:
pd.Series(brics_currency , index = brics_country)

Brazil              Real
Russia             Ruble
India              Rupee
China           Renminbi
South Africa        Rand
dtype: object

# Dataframe

In [40]:
brics_country = ['Brazil', 'Russia', 'India', 'China', 'South Africa']

brics_currency = ['Real', 'Ruble', 'Rupee', 'Renminbi', 'Rand' ]

In [42]:
# Method 1

pd.DataFrame({'col_1' :brics_country ,
             'col_2' : brics_currency})

          col_1     col_2
0        Brazil      Real
1        Russia     Ruble
2         India     Rupee
3         China  Renminbi
4  South Africa      Rand

In [47]:
# Method 2

pd.DataFrame([brics_country , brics_currency] , index = ['col_1' , 'col_2']).T

          col_1     col_2
0        Brazil      Real
1        Russia     Ruble
2         India     Rupee
3         China  Renminbi
4  South Africa      Rand

In [56]:
lst = ['Ganga' , 'Yamuna' , 'Brahmaputra' , 'Jehlum' , 'Kaveri']

lst_2 = ['uttrakhand' , 'UP' , 'Assam' , 'JK' , 'Karnataka']

pd.DataFrame({'States' : lst_2 ,
             'Rivers' :lst })

       States       Rivers
0  uttrakhand        Ganga
1          UP       Yamuna
2       Assam  Brahmaputra
3          JK       Jehlum
4   Karnataka       Kaveri

In [58]:
lst = ['Ganga' , 'Yamuna' , 'Brahmaputra' , 'Jehlum' , 'Kaveri']

lst_2 = ['uttrakhand' , 'UP' , 'Assam' , 'JK' , 'Karnataka']

pd.DataFrame([lst , lst_2] , index = ['States' , 'rivers']).T

        States      rivers
0        Ganga  uttrakhand
1       Yamuna          UP
2  Brahmaputra       Assam
3       Jehlum          JK
4       Kaveri   Karnataka

In [61]:
df_dict = {'Year' : [1990, 1994, 1998, 2002],
           'Country' : ['Italy', 'USA', 'France', 'Japan'],
           'Winner' : ['Germany', 'Brazil', 'France', 'Brazil'],
           'GoalScored' : [115, 141, 171, 161]
          }

pd.DataFrame(df_dict)

   Year Country   Winner  GoalScored
0  1990   Italy  Germany         115
1  1994     USA   Brazil         141
2  1998  France   France         171
3  2002   Japan   Brazil         161

In [63]:
df_lotuples = [(2002, 'Japan', 'Brazil', 161), 
                (2006, 'Germany', 'Italy', 147), 
                (2010, 'South Africa', 'Spain', 145),
                (2014, 'Brazil', 'Germany', 171)
              ]

pd.DataFrame(df_lotuples , columns= ['Year' ,	'Country' ,	'Winner' 	,'GoalScored'])

   Year       Country   Winner  GoalScored
0  2002         Japan   Brazil         161
1  2006       Germany    Italy         147
2  2010  South Africa    Spain         145
3  2014        Brazil  Germany         171

In [65]:
df_dict = {'Year' : [1990, 1994, 1998, 2002],
           'Country' : ['Italy', 'USA', 'France', 'Japan'],
           'Winner' : ['Germany', 'Brazil', 'France', 'Brazil'],
           'GoalScored' : [115, 141, 171]
          }

pd.DataFrame(df_dict)

ValueError: All arrays must be of the same length

In [66]:
df_dict = {'Year' : pd.Series([1990, 1994, 1998, 2002]),
           'Country' : pd.Series(['Italy', 'USA', 'France', 'Japan']),
           'Winner' : pd.Series(['Germany', 'Brazil', 'France', 'Brazil']),
           'GoalScored' : pd.Series([115, 141, 171])
          }

pd.DataFrame(df_dict)

   Year Country   Winner  GoalScored
0  1990   Italy  Germany       115.0
1  1994     USA   Brazil       141.0
2  1998  France   France       171.0
3  2002   Japan   Brazil         NaN

In [68]:
df_dict = {'Year' : pd.Series([1990, 1994, 1998, 2002]),
           'Country' : pd.Series(['Italy', 'USA', 'France', 'Japan']),
           'Winner' : pd.Series(['Germany', 'Brazil', 'France', 'Brazil']),
           'GoalScored' : pd.Series([115, 141,  161])
          }

pd.DataFrame(df_dict)

   Year Country   Winner  GoalScored
0  1990   Italy  Germany       115.0
1  1994     USA   Brazil       141.0
2  1998  France   France       161.0
3  2002   Japan   Brazil         NaN

In [70]:
df_dict = {'Year' : [1990, 1994, 1998, 2002],
           'Country' : ['Italy', 'USA', 'France', 'Japan'],
           'Winner' : ['Germany', 'Brazil', 'France', 'Brazil'],
           'GoalScored' : [115, 141, None, 161]
          }

pd.DataFrame(df_dict)

   Year Country   Winner  GoalScored
0  1990   Italy  Germany       115.0
1  1994     USA   Brazil       141.0
2  1998  France   France         NaN
3  2002   Japan   Brazil       161.0

In [ ]:
# CSV

In [73]:
pd.read_csv('datasets/ted_data.csv')

,name_speaker,speaker_occupation,title,views,comments
0,Ken Robinson,Author/educator,Do schools kill creativity?,47227110,4553
1,Al Gore,Climate advocate,Averting the climate crisis,3200520,265
2,David Pogue,Technology columnist,Simplicity sells,1636292,124
3,Majora Carter,Activist for environmental justice,Greening the ghetto,1697550,200
4,Hans Rosling,Global health expert; data visionary,The best stats you've ever seen,12005869,593
5,Tony Robbins,Life coach; expert in leadership psychology,Why we do what we do,20685401,672
6,Julia Sweeney,"Actor, comedian, playwright",Letting go of God,3769987,919
7,Joshua Prince-Ramus,Architect,Behind the design of Seattle's library,967741,46
8,Dan Dennett,"Philosopher, cognitive scientist",Let's teach religion -- all religion -- in sch...,2567958,582
9,Rick Warren,"Pastor, author",A life of purpose,3095993,900

In [ ]:
# Excel

In [74]:
pd.read_excel('datasets/football_worldcup.xlsx')

   Year       Country    Winner   Runners-Up  GoalsScored  MatchesPlayed
0  1990         Italy  Germany     Argentina          115             52
1  1994           USA    Brazil        Italy          141             52
2  1998        France    France       Brazil          171             64
3  2002         Japan    Brazil      Germany          161             64
4  2006       Germany     Italy       France          147             64
5  2010  South Africa     Spain  Netherlands          145             64
6  2014        Brazil   Germany    Argentina          171             64

In [87]:
df = pd.read_csv('datasets/ted_data.csv')

df

,name_speaker,speaker_occupation,title,views,comments
0,Ken Robinson,Author/educator,Do schools kill creativity?,47227110,4553
1,Al Gore,Climate advocate,Averting the climate crisis,3200520,265
2,David Pogue,Technology columnist,Simplicity sells,1636292,124
3,Majora Carter,Activist for environmental justice,Greening the ghetto,1697550,200
4,Hans Rosling,Global health expert; data visionary,The best stats you've ever seen,12005869,593
5,Tony Robbins,Life coach; expert in leadership psychology,Why we do what we do,20685401,672
6,Julia Sweeney,"Actor, comedian, playwright",Letting go of God,3769987,919
7,Joshua Prince-Ramus,Architect,Behind the design of Seattle's library,967741,46
8,Dan Dennett,"Philosopher, cognitive scientist",Let's teach religion -- all religion -- in sch...,2567958,582
9,Rick Warren,"Pastor, author",A life of purpose,3095993,900

# Basic function

In [76]:
df.shape

(10, 5)

In [79]:
df.head(6)

,name_speaker,speaker_occupation,title,views,comments
0,Ken Robinson,Author/educator,Do schools kill creativity?,47227110,4553
1,Al Gore,Climate advocate,Averting the climate crisis,3200520,265
2,David Pogue,Technology columnist,Simplicity sells,1636292,124
3,Majora Carter,Activist for environmental justice,Greening the ghetto,1697550,200
4,Hans Rosling,Global health expert; data visionary,The best stats you've ever seen,12005869,593
5,Tony Robbins,Life coach; expert in leadership psychology,Why we do what we do,20685401,672

In [88]:
df.tail(2)

,name_speaker,speaker_occupation,title,views,comments
8,Dan Dennett,"Philosopher, cognitive scientist",Let's teach religion -- all religion -- in sch...,2567958,582
9,Rick Warren,"Pastor, author",A life of purpose,3095993,900

In [89]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   name_speaker        10 non-null     object
 1   speaker_occupation  10 non-null     object
 2   title               10 non-null     object
 3   views               10 non-null     int64
 4   comments            10 non-null     int64
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [93]:
df = pd.read_csv('datasets/weather_data.csv')

df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [94]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          6 non-null      object
 1   temperature  6 non-null      int64
 2   windspeed    6 non-null      int64
 3   event        6 non-null      object
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [95]:
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [97]:
df.describe(include= 'object')

             day event
count          6     6
unique         6     3
top     1/1/2017  Rain
freq           1     2

In [98]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

# Indexing and slicing